{
  "pages": [
    {
      "icon": "refraction:textures/items/book.png",
      "title": "Getting Started",
      "subpages": [
        {
          "title": "Hello",
          "text": [
            "Hello there, [player]! I'm Eve, your personal assistant!",
            "",
            "I'm here to help you &m<study phys&kics&r&m>&rlearn how to manipulate light using reflection and refraction!",
            "",
            "",
            "Ever wanted to suck items and entities with a single beam of light? Ever wanted to create a disco ball based quarry? How about creating a laser defense system? Or, heck, maybe you just wanted to make an epic laser show?",
            "",
            "",
            "Well then, [player], welcome to my world of reflection and refraction! You will not be disappointed at the results of mirror arrays and rainbows.",
            "",
            "",
            "Let's get started, shall we?"
          ],
          "extra": [
            {
              "image": "refraction:textures/refraction_logo.png",
              "title": "Refraction"
            }
          ]
        },
        {
          "title": "The Rainbow",
          "text": [
            "I'm first going to start off by teaching you the very concept and nature of light manipulation, so to start off: Light is made up of 3 primary colors: &c&lRed&r, &a&lGreen&r, and &1&lBlue&r. They are often merged into the familiar phrase '&c&lR&a&lG&1&lB&r'. You will base your color merging knowledge on those 3 primary colors.",
            "",
            "Light also has a strength, or in more technical terms is called 'alpha value'. In this mod, we represented this value as the 'white bar' indicating power/strength/amount/alpha or whatever you want to call it.",
            "",
            "",
            "So now we have RGB and A (or RGBA). You start off with a white beam (which we will get to later in [Baby Steps]). A white beam or white color in general is a color mix of all three primary colors. It contains red, green, and blue in equal amounts merged.",
            "",
            "You will be basing your work on this knowledge because you want to acquire the many different colors from white beams which will be split (later on).",
            "",
            "",
            "The way we represent the rgb values (in recipes and the spectrometer) is using ratios. So if the spectrometer is showing half red and half blue, it means it doesn't matter 'how much of blue and red in values' you have, it means that you just need a perfectly equal amount of both with respect to each other.",
            "",
            "The value that DOES matter and not as a ratio is the white bar which indicates alpha/strength/amount.",
            "",
            "You can see the recipe of the [recipe:refraction:reflection_chamber] on the right tab to see an example of the bars viewed in the recipes.",
            "",
            "",
            "&c&l[!] FOR FUTURE REFERENCE [!]&r These values are by DEFAULT unless the modpack author tampered with them:",
            "",
            "Solar alpha/strength (used in magnifiers): [config:solar_strength]",
            "",
            "Glowstone alpha/strength (used in laser blocks): [config:glowstone_strength]"
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/rainbow.png",
              "title": "RGB"
            }
          ]
        },
        {
          "title": "Baby Steps",
          "text": [
            "Ok, let's see here... Ah, yes. So you'll first want to make a [recipe:refraction:assembly_table]. This simple block will help you craft everything you need. I will guide you through the steps of its usage when we get to that.",
            "",
            "For now, craft one. It requires 7 iron ingots and 1 [recipe:refraction:lens].",
            "",
            "",
            "Next, you'll want to craft a [recipe:refraction:magnifier]. When provided with a 3x3 of lens blocks above it - provided that they have a line of sight to the sky - it will converge the sunlight into a focused beam of light directly below it.",
            "",
            "",
            "I should note that you should place the magnifier (with the lens blocks above it) anywhere above the assembly table. This will be a one time setup to get you the basic items and can be altered after we're done with the second step."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/assembly_table_setup.png",
              "title": "Initial Setup"
            }
          ]
        },
        {
          "title": "Oooh, Shiny",
          "text": [
            "Neither gold nor iron have the reflective properties you'd want to be able to play around with light, but they both are a step in the right direction.",
            "",
            "",
            "To get something very reflective, craft an iron ingot with a gold ingot in a regular crafting window.",
            "",
            "",
            "It'll give you a highly [recipe:refraction:reflective_alloy], very useful for light manipulation."
          ]
        },
        {
          "title": "Reflection",
          "text": [
            "Now that you have more reflective resources, you can dispense with the annoyance of placing the [recipe:refraction:magnifier] exactly above the table. By creating a [recipe:refraction:mirror] with reflective alloys and rotating it using a [recipe:refraction:screw_driver] you can redirect beams to any direction.",
            "",
            "You can craft a [recipe:refraction:mirror] using the assembly table you crafted. The Assembly table will allow you to make such materials, by using magnifiers to focus beams into it and providing a &lredstone signal&r, it will fuse the items inside of it together provided the beams being pointed into it evaluate to the correct color range and add up to the proper beam strength value (that also has a max and min per recipe).",
            "",
            "",
            "&lIN LAYMAN'S TERMS:&r Each assembly table recipe requires different colored beams to be pointed at it and a specific alpha value range that needs to be met for it to be able to craft your item.&r",
            "",
            "If you focus multiple beams into an assembly table, it'll be able to do more intense recipes, granting you more components to play with which you can read about later. For now, let me tell you how to craft the mirror:",
            "",
            "",
            "To figure out how many beams you need pointed at the assembly table to craft this, take the minimum alpha value the mirror requires in it's recipe and divide it by the alpha strength of the magnifiers ( [config:solar_strength] ) . This is the amount of beams you need to point at the assembly table.",
            "",
            "If the packmaker has not tampered with the recipe of this, the mirror should require one beam. Do double check.",
            "",
            "And if the packmaker hasn't tampered with the color values of the recipe as well, the recipe should only require a white beam since its recipe requires 255 of all 3 colors (red, green, blue) and requires an alpha value of [config:solar_strength]. Luckily, you presumable already made a setup for that! Feed the table the items by right clicking it and &lpowering it with a redstone signal&r. Red particles will signal progress, a green flash will signal completion",
            "",
            "",
            "And now that you have a mirror:",
            "",
            "Using the screwdriver on the air will decrease its precision, and sneak-using it will increase its precision. Using it on a mirror's top will rotate it horizontally, and on a mirror's side will rotate it vertically."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/mirror_array_setup.png",
              "title": "Mirror Array"
            }
          ]
        },
        {
          "title": "Refraction",
          "text": [
            "So far, you've only witnessed thin white beams, let's change it up a bit!",
            "",
            "",
            "Different colors of beams can produce some effects. These effects can be highly beneficial to your needs, or just plain fun. I'll get to these effects later on, but to acquire them, you'll want to craft yourself a [recipe:refraction:prism].",
            "",
            "This particular block will split a light beam into it's three basic colors: red, green, and blue. We'll get to the effects of these colors later on, as I've already said, but to acquire this block, you'll want a minimum of 5 mirrors all pointing into the assembly table with beams from magnifiers on each of them.",
            "",
            "Next, right click the assembly table with 6 lens blocks to input the items and provide a redstone signal to the table and it will craft you your first prism.",
            "",
            "",
            "&c&l[!] WARNING [!]&r Do NOT place the prism in front of a beam just yet. Please read the next section before proceeding because the next part can be lethal to both your person and your surroundings if caution is not taken!"
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/prism_splitting.png",
              "title": "Prism Splitting"
            }
          ]
        },
        {
          "title": "RGB",
          "text": [
            "Now, I know what you might be thinking: Eve, what the crap are the effects, what do they look like, and how do I use them already?!",
            "",
            "",
            "Ok, so first off: I'm just doing my job calm down. I NEED to give you the precautions and warnings beforehand. Anyways, I'll stop babbling and start:",
            "",
            "As I've said above, a prism will split light beams into 3 separate colors: red, green, and blue. All three have separate effects which are the following: ",
            "",
            "",
            "The blue beam is a freeze effect. It will slow you down when it's at low strength. Higher strengths include blindness, nausea, weakenss, etc..",
            "",
            "",
            "The green beam is a bonemeal beam. If pointed at a bonemealable block, it has a chance based on it's strength to bonemeal the block",
            "",
            "",
            "And now comes the most dangerous part... The red beam is a burn beam. It has a chance based on it's strength to set any block it touches on fire and any entity it touches aflame. This beam is &mextremely&r dangerous",
            " if not created with caution because it can and WILL burn down your surroundings easily if you are not careful. This is especially true because of the green beam, because if an area gets bonemealed and burnt, it will cause",
            " tons of fire based damage to your area.",
            "",
            "",
            "The moment you place down the prism, all 3 of these beams will be split and refracted outwards. Be VERY careful that you are in a safe, burn free zone."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/prism_splitting.png",
              "title": "Prism Splitting"
            }
          ]
        },
        {
          "title": "Effects",
          "text": [
            "So, if you haven't burnt down your area already, let's get to the more notable effects. You can get the rest of the effects from the mod using a [recipe:refraction:reflection_chamber].",
            "",
            "This block will merge any two or more beams that intersect with it and produce a final beam based on the weighted average of all the colors that went into it, taking into account color strength as well as outputting the beam in an averaged angle between them all.",
            "",
            "This block is extremely useful as it is able to produce the entire color spectrum if use right. You'll want it to use the rest of the effects in the mod, which are:",
            "",
            "",
            "Cyan: Attract entities (items). If the beam is strong enough, it will attract any living entity.",
            "",
            "",
            "Magenta: Disperse entities (items). If the beam is strong enough, it will disperse any living entity.",
            "",
            "",
            "Yellow: Has a chance, based on strength, to break blocks it touches.",
            "",
            "",
            "Pink: Has a chance, based on strength, to place a block that it intersects with in item form.",
            "",
            "",
            "Orange: When pointed at a redstone component, will power it. Has to have at least 1 air block available anywhere around the block it's pointing at. Also will respect the side of the redstone component it hits. Redstone power output depends on potency."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/reflection_chamber.png",
              "title": "Beam Merging"
            }
          ]
        },
        {
          "title": "Merging",
          "text": [
            "Due to much confusion relating to the crafting of blocks, I shall guide you on how to make the [recipe:refraction:reflection_chamber] step by step to help you out.",
            "",
            "First of all, you'll want to start off with "
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/prism_splitting.png",
              "title": "Prism Splitting"
            }
          ]
        }
      ]
    },
    {
      "icon": "refraction:textures/items/laser_pointer.png",
      "title": "Items",
      "subpages": [
        {
          "title": "Screwdriver",
          "text": [
            "You've already supposedly read and used the [recipe:refraction:screw_driver], but to recap:",
            "",
            "",
            "Right click the air to increment it's angle. Shift right click to decrement.",
            "",
            "Right click the top or bottom of a mirror/splitter to rotate it around the y-axis. Shift right click to reverse the rotation",
            "",
            "",
            "Right click the sides of a mirror/splitter to rotate it around the x-axis. Shift right click to reverse the rotation.",
            "",
            "Setting the angle and placing the screwdriver in a dispenser facing a mirror then powering it (INDIRECTLY - read warning) ",
            "will change the mirror's angle as if you right clicked it on the face the dispenser is hitting.",
            "",
            "",
            "To invert the dispenser as if it's shift right clicking the screw driver, put the screwdriver into a crafting gird.",
            "the output of the recipe will be an 'inverted' screwdriver that will do what you want on dispensers and vice versa to reinvert it.",
            "",
            "&c&l[!] WARNING [!]&r Powering a dispenser with a screwdriver with a direct line of redstone power to adjust a mirror might seem glitchy. This is because",
            "powering a mirror will set it's angle to it's 'powered' state and vice versa. To fix this, simply power the dispenser INDIRECTLY through a block."
          ]
        },
        {
          "title": "Reflective Alloy",
          "text": [
            "You've already seen the [recipe:refraction:reflective_alloy] ingots, but what you didn't know is that it has a block variation.",
            "",
            "The block form of this alloy will reflect/bounce all beams that intersect with it in the cardinal direction hit.",
            "",
            "",
            "In a way, it's sort of a cheap precisionless mirror. This block is considered as great protection against volatile or dangerous beams.",
            "",
            "",
            "You can also craft reflective alloy armor with this ingot. Each piece will decrease the potency of any beam effect that hits you. A full set wont completely negate effects, but you will become a walking mirror. IE: Beams will literally bounce and reflect off of you in the direction you face."
          ]
        },
        {
          "title": "Laser Pen",
          "text": [
            "KAT LAZORS."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/laser_pen.png",
              "title": "Laser Pen"
            }
          ]
        },
        {
          "title": "Photon Grenades",
          "text": [
            "When placed into an assembly table with any beam hitting it, it will infuse the grenade with that color.",
            "When thrown, the grenade will explode violently with the color (taking into account the original strength as well)"
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/photon_grenade.png",
              "title": "Photon Grenade"
            }
          ]
        },
        {
          "title": "Photon Cannon",
          "text": [
            "The [recipe:refraction:photon_cannon] is a gun that continuously fires a beam provided you have a [recipe:refraction:light_cartridge] in your inventory.",
            "",
            "When holding the gun, the bar on the right side of your HUD will show up indicating the fuel or amount of ammo left in the loaded cartridge.",
            "",
            "You can hold multiple cartridges in your inventory at once. To swap which color the gun will use, hold the gun, then scroll while sneaking. You will flip through the colors and can stop at any one to choose the color desired.",
            "",
            "",
            "It is worth noting that the hud on the right, indicating fuel or amount of energy left per color, is a sum of all the cartridges with the same color available in your inventory."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/photon_grenade.png",
              "title": "Photon Grenade"
            }
          ]
        }
      ]
    },
    {
      "icon": "refraction:textures/items/disco_ball.png",
      "title": "Blocks",
      "subpages": [
        {
          "title": "Laser",
          "text": [
            "The [recipe:refraction:laser] block, when fed with glowstone, will produce a light beam that lasts for 25 seconds.",
            "",
            "",
            "This block is different from a magnifier in that it's beam is 4x more powerful in strength than a magnifier.",
            "",
            "",
            "You can insert glowstone into it by either right clicking on it or pointing a hopper into it.",
            "",
            "",
            "If you want to continually power it automatically, consider a witch farm or a mob farm that filters witches."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/laser_block.png",
              "title": "Laser Block"
            }
          ]
        },
        {
          "title": "Electric Laser",
          "text": [
            "The [recipe:refraction:electric_laser] block is like the regular laser block. The only difference is that it accepts tesla/forge energy instead of glowstone."
          ]
        },
        {
          "title": "Mirrors / Splitter",
          "text": [
            "This [recipe:refraction:splitter] block is a half-mirror. It has the same properties as a mirror, but instead of reflecting a beam directly",
            ", the beam will be split into 2 halves. One is reflected like that of a normal mirror, and the other half phases",
            " right through the beam."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/splitter.png",
              "title": "Splitter"
            }
          ]
        },
        {
          "title": "Disco Ball",
          "text": [
            "The [recipe:refraction:disco_ball] is one of the most interesting blocks in the mod.",
            "",
            "When this block receives a redstone signal, it will start spinning (it's a disco ball after all).",
            "",
            "When a beam hits this block while it's active, it will spread the beam in all directions. This results in",
            " some very very interesting behavior. This can also be considered to be one of the most powerful and most dangerous",
            " blocks in the mod. You can point any beam into it and it will produce smaller beams of that color in every single direction.",
            "",
            "",
            "You could point a burn beam at it and it'll burn everything surrounding it, or point a yellow beam and have it become a circular quarry.",
            "",
            "",
            "&c&l[!] WARNING [!]&r It is HIGHLY recommended you surround the block with reflective alloy blocks to avoid potential disasters from occuring."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/disco_ball.png",
              "title": "Disco Ball"
            }
          ]
        },
        {
          "title": "Sensor",
          "text": [
            "This little dongle of a block will produce a flashing redstone signal against the block it's placed against.",
            "",
            "You can get a full continuous signal with 1 repeater from it but it's a good compact clock block otherwise when a beam intersects with it.",
            "",
            "",
            "Moreover, beams will phase directly through it for convenience."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/sensor.png",
              "title": "Sensor"
            }
          ]
        },
        {
          "title": "Optic Fiber",
          "text": [
            "Optic fiber cables are very important cabling here. Any beam pointed at one end of an optic fiber cable will output the beam",
            " at the other end of the cable whilst also adjusting it to the cardinal direction it's facing with absolutely no loss.",
            "",
            "One of the 2 cable facings will always face the direction you place it against for convenience. No more than 2 connections can be made per",
            " fiber optic cable, so it cannot split beams.",
            "",
            "These cables are also useful when working with reflection chambers. If you place a cable against the face of a reflection chamber",
            " - provided that the angle of the output beam from the reflection chamber is from the face the cable is against - it will output the beam",
            " straight to the cable, directly adjusting it to a cardinal direction."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/optic_fiber.png",
              "title": "Optic Fiber"
            }
          ]
        },
        {
          "title": "Spectrometer",
          "text": [
            "The spectrometer is a block that can show you the strength of each individual array of color from a beam intersecting with the block.",
            "",
            "It will show you red, green, blue, and white bars on its face indicating the rgb values of the beams hitting it as well as white acting as beam strength."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/spectrometer.png",
              "title": "Spectrometer"
            }
          ]
        },
        {
          "title": "Electron Exciter",
          "text": [
            "Our friends at aperture science have provided us with their amazing technology of hard light bridges!",
            "",
            "By pointing 2 (or more) attraction (cyan) beams perfectly parallel and pointing straight into 2 adjacent [recipe:refraction:electron_exciter]s, a bridge made out of pure light will form between them.",
            "",
            "",
            "This bridge is indestructible, and therefore great for a plethora of uses. You can stack multiple bridges next to each other and in any direction.",
            "",
            "",
            "My friend, GlAdOs, told me to send you this message: 'These bridges are made from natural light that we pumped in from the surface. If you rubbed your cheek on one, it would be like standing outside with the sun shining on your face. It would also set your hair on fire, so don't actually do it."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/light_bridge.png",
              "title": "Light Bridges"
            }
          ]
        },
        {
          "title": "AXYZ",
          "text": [
            "The [recipe:refraction:axyz] is a rather odd block. It's essentially a wormhole generator. Quite complex in usage.",
            "",
            "I was told that this technology isn't quite advanced enough yet, as it can generate wormholes, but only photons can pass through, while matter, on the other hand, cannot. Any beam that goes in will come out the other end, but the wormhole isn’t stable enough to work the other way around.",
            "",
            "The tear in space and time isn't big nor powerful enough to do anything but transport beams.",
            "",
            "The mechanics of this device are unusual to say the least. It says here that you need to feed a dispersion beam (magenta) into a [recipe:refraction:translocator] pointed directly at the generator, via fiber optic cables hooked into the translocator.",
            "",
            "Apparently, passing a dispersion beam through the translocator will cause it to affect the wormhole generator, causing the generator to be pushed directly away from the translocator. What seems to be happening here is that you are displacing the wormhole generator, but not the other end of the wormhole, allowing you to separate the two ends. ",
            "",
            "The [recipe:refraction:axyz] is also pushable by a piston. Unlike using a dispersion beam, pushing the wormhole generator via a piston will also move the bound wormhole. Therefore, the wormhole will shift in the same direction in which the generator is pushed.",
            "",
            "A 'quantum entanglement' of sorts.",
            "",
            "",
            "By repeating the process of using teleposers and pistons on the generator, you can treat the generator like a 'cursor' to move the wormhole freely in the world. This can allow for some more advanced machines such as automatically moving quarries."
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/wormhole.png",
              "title": "AXYZ With Wormhole"
            }
          ]
        }
      ]
    },
    {
      "icon": "refraction:textures/items/mirror.png",
      "title": "Misc",
      "subpages": [
        {
          "title": "Inventory Management",
          "text": [
            "You might be wondering if there's a way to extract and insert items to and from inventories using light. Well... There is!",
            "",
            "",
            "The disperse (magenta) and attract (cyan) effects can insert and extract items to and from inventories respectively.",
            "",
            "The actual process however, is a bit crude... You see... You have to kinda... Burn a hole into the inventory with a burn beam first.",
            " A laser pointing at the inventory will then extract or insert the items through that hole. So you must point a burn beam on the inventory desired.",
            "",
            "",
            "Physics is beautiful, isn't it?"
          ],
          "extra": [
            {
              "image": "refraction:textures/gui/tabletimages/insert_extract.png",
              "title": "Insert & Extract"
            }
          ]
        },
        {
          "title": "Gravity Beam",
          "text": [
            "The gravity beam is a very dangerous beam. To acquire it, you point a disperse (magenta) beam in an electron exciter, and any adjacent electron exciters will output the gravity beam,",
            "",
            "",
            "The gravity beam will completely nullify an entity's gravity. But that's not the interesting/dangerous part!",
            "",
            "The block a gravity beam touches will completely protect the block from taking any form of damage. Not only that, but it will also completely prevent players from interacting with the block.",
            "",
            "Chests will not be openable, for example, and you will not be able to place a block against a gravity beam protected block.",
            "",
            "However, if a block that is not a tile entity nor a reflective alloy block has an air block below it, the gravity beam will make the block fall."
          ]
        }
      ]
    }
  ]
}
