{
  "pages": [
    {
      "icon": "refraction:items/book",
      "info": "Getting Started",
      "subpages": [
        {
          "info": "Hello",
          "text": [
            "Hello there, ",
            {
              "type": "player"
            },
            "! I'm Eve, your personal assistant!",
            "",
            "I'm here to help you ",
            {
              "text": "<study phys",
              "strikethrough": true
            },
            {
              "text": "ICS",
              "obfuscated": true,
              "strikethrough": true
            },
            {
              "text": ">",
              "strikethrough": true
            },
            "learn how to manipulate light using reflection and refraction!",
            "",
            "",
            "Ever wanted to suck items and entities with a single beam of light? Ever wanted to create a disco ball based quarry? How about creating a laser defense system? Or, heck, maybe you just wanted to make an epic laser show?",
            "",
            "",
            "Well then, ",
            {
              "type": "player"
            },
            ", welcome to my world of reflection and refraction! You will not be disappointed at the results of mirror arrays and rainbows.",
            "",
            "",
            "Let's get started, shall we?"
          ]
        },
        {
          "info": "Baby Steps",
          "text": [
            "Ok, let's see here... Ah, yes. So you'll first want to make a",
            {
              "type": "stack",
              "id": "refraction:assembly_table"
            },
            ". This simple block will help you craft everything you need. I will guide you through the steps of its usage when we get to that.",
            "",
            "For now, craft one. It requires 7 iron ingots and 1",
            {
              "type": "stack",
              "id": "refraction:lens"
            },
            ".",
            "",
            "",
            "Next, you'll want to craft a",
            {
              "type": "stack",
              "id": "refraction:magnifier"
            },
            ". When provided with a 3x3 of lens blocks above it - provided that they have a line of sight to the sky - it will converge the sunlight into a focused beam of light directly below it.",
            "",
            "",
            "I should note that you should place the magnifier (with the lens blocks above it) anywhere above the assembly table. This will be a one time setup to get you the basic items and can be altered after we're done with the second step."
          ]
        },
        {
          "info": "Oooh, Shiny",
          "text": [
            "Neither gold nor iron have the reflective properties you'd want to be able to play around with light, but they both are a step in the right direction. The Assembly table will allow you to make such materials, by using Magnifiers to focus beams inside.",
            "",
            "",
            "To get something very reflective, using a beam to fuse three iron and three gold in the table should be sufficient. The table requires redstone power to function, to get the components running.",
            "",
            "",
            "It'll give you a highly",
            {
              "type": "stack",
              "id": "refraction:reflective_alloy"
            },
            ", very useful for light manipulation."
          ]
        },
        {
          "info": "Reflection",
          "text": [
            "Now that you have more reflective resources, you can dispense with the annoyance of placing the",
            {
              "type": "stack",
              "id": "refraction:magnifier"
            },
            " exactly above the table. By creating a",
            {
              "type": "stack",
              "id": "refraction:mirror"
            },
            " with reflective alloys and rotating it using a",
            {
              "type": "stack",
              "id": "refraction:screwdriver"
            },
            " you can redirect beams to any direction.",
            "",
            "",
            "Using the screwdriver on the air will decrease its precision, and sneak-using it will increase its precision. Using it on a mirror's top will rotate it horizontally, and on a mirror's side it'll rotate it vertically.",
            "",
            "",
            "If you focus multiple beams into an assembly table, it'll be able to do more intense recipes, granting you more components to play with."
          ]
        },
        {
          "info": "Refraction",
          "text": [
            "So far, you've only witnessed thin white beams, let's change it up a bit!",
            "",
            "",
            "Different colors of beams can produce some effects. These effects can be highly beneficial to your needs, or just plain fun. I'll get to these effects later on, but to acquire them, you'll want to craft yourself a prism.",
            "",
            "This particular block will split a light beam into it's three basic colors: red, green, and blue. We'll get to the effects of these colors later on, as I've already said, but to acquire this block, you'll want a minimum of 5 mirrors all pointing into the assembly table with beams from magnifiers on each of them.",
            "",
            "Next, right click the assembly table with 6 lens blocks to input the items and provide a redstone signal to the table and it will craft you your first prism.",
            "",
            "",
            {
              "text": "[!] WARNING [!]",
              "color": "red",
              "bold": "true"
            },
            " Do NOT place the prism in front of a beam just yet. Please read the next section before proceeding because the next part can be lethal to both your person and your surroundings if caution is not taken!"
          ]
        },
        {
          "info": "RGB",
          "text": [
            "Now, I know what you might be thinking: Eve, what the crap are the effects, what do they look like, and how do I use them already?!",
            "",
            "",
            "Ok, so first off: I'm just doing my job calm down. I NEED to give you the precautions and warnings beforehand. Anyways, I'll stop babbling and start:",
            "",
            "As I've said above, a prism will split light beams into 3 separate colors: red, green, and blue. All three have separate effects which are the following: ",
            "",
            "",
            "The blue beam is a freeze effect. It will slow you down when it's at low strength. Higher strengths include blindness, nausea, weakenss, etc..",
            "",
            "",
            "The green beam is a bonemeal beam. If pointed at a bonemealable block, it has a chance based on it's strength to bonemeal the block",
            "",
            "",
            "And now comes the most dangerous part... The red beam is a burn beam. It has a chance based on it's strength to set any block it touches on fire and any entity it touches aflame. This beam is EXTREMELY dangerous",
            " if not created with caution because it can and WILL burn down your surroundings easily if you are not careful. This is especially true because of the green beam, because if an area gets bonemealed and burnt, it will cause",
            "tons of fire based damage to your area.",
            "",
            "",
            "The moment you place down the prism, all 3 of these beams will be split and refracted outwards. Be VERY careful that you are in a safe, burn free zone."
          ]
        },
        {
          "info": "Effects",
          "text": [
            "So, if you haven't burnt down your area already, let's get to the more notable effects. You can get the rest of the effects from the mod using a",
            {
              "type": "stack",
              "id": "refraction:reflection_chamber"
            },
            ".",
            "",
            "This block will merge any two or more beams that intersect with it and produce a final beam based on the weighted average of all the colors that went into it, taking into account color strength as well as outputting the beam in an averaged angle between them all.",
            "",
            "This block is extremely useful as it is able to produce the entire color spectrum if used right. You'll want it to use the rest of the effects in the mod, which are:",
            "",
            "",
            "Cyan: Attract entities (items). If the beam is strong enough, it will attract any living entity.",
            "",
            "",
            "Magenta: Disperse entities (items). If the beam is strong enough, it will disperse any living entity.",
            "",
            "",
            "Yellow: Has a chance, based on strength, to break blocks it touches.",
            "",
            "",
            "Pink: Has a chance, based on strength, to place a block that it intersects with in item form."
          ]
        }
      ]
    },
    {
      "icon": "refraction:items/disco_ball",
      "info": "Items & Blocks",
      "subpages": [
        {
          "info": "Laser",
          "text": [
            "The laser block, when fed with glowstone, will produce a light beam that lasts for 25 seconds.",
            "",
            "",
            "This block is different from a magnifier in that it's beam is 4x more powerful in strength than a magnifier.",
            "",
            "",
            "You can insert glowstone into it by either right clicking on it or pointing a hopper into it.",
            "",
            "",
            "If you want to continually power it automatically, consider a witch farm or a mob farm that filters witches."
          ]
        },
        {
          "info": "Screwdriver",
          "text": [
            "You've already supposedly read and used the screwdriver, but to recap:",
            "",
            "",
            "Right click the air to increment it's angle. Shift right click to decrement.",
            "",
            "Right click the top or bottom of a mirror/splitter to rotate it around the y-axis. Shift right click to reverse the rotation",
            "",
            "",
            "Right click the sides of a mirror/splitter to rotate it around the x-axis. Shift right click to reverse the rotation.",
            "",
            "Setting the angle and placing the screwdriver in a dispenser facing a mirror then powering it (INDIRECTLY - read warning) ",
            "will change the mirror's angle as if you right clicked it on the face the dispenser is hitting.",
            "",
            "",
            "To invert the dispenser as if it's shift right clicking the screw driver, put the screwdriver into a crafting gird.",
            "the output of the recipe will be an 'inverted' screwdriver that will do what you want on dispensers and vice versa to reinvert it.",
            {
              "text": "[!] WARNING [!]",
              "color": "red",
              "bold": "true"
            },
            " Powering a dispenser with a screwdriver with a direct line of redstone power to adjust a mirror might seem glitchy. This is because",
            "powering a mirror will set it's angle to it's 'powered' state and vice versa. To fix this, simply power the dispenser INDIRECTLY through a block."
          ]
        },
        {
          "info": "Mirrors / Splitter",
          "text": [
            "This block is a half-mirror. It has the same properties as a mirror, but instead of reflecting a beam directly",
            ", the beam will be split into 2 halves. One is reflected like that of a normal mirror, and the other half phases",
            " right through the beam."
          ]
        },
        {
          "info": "Reflective Alloy",
          "text": [
            "You've already seen the reflective alloy ingots, but what you didn't know is that it has a block variation.",
            "",
            "The block form of this alloy will reflect/bounce all beams that intersect with it in the cardinal direction hit.",
            "",
            "",
            "In a way, it's sort of a cheap precisionless mirror. This block is considered as great protection against volatile or dangerous beams."
          ]
        },
        {
          "info": "Disco Ball",
          "text": [
            "The disco ball is one of the most interesting blocks in the mod.",
            "",
            "When this block receives a redstone signal, it will start spinning (it's a disco ball after all).",
            "",
            "When a beam hits this block while it's active, it will spread the beam in all directions. This results in",
            " some very very interesting behavior. This can also be considered to be one of the most powerful and most dangerous",
            " blocks in the mod. You can point any beam into it and it will produce smaller beams of that color in every single direction.",
            "",
            "",
            "You could point a burn beam at it and it'll burn everything surrounding it, or point a yellow beam and have it become a circular quarry.",
            "",
            "",
            {
              "text": "[!] WARNING [!]",
              "color": "red",
              "bold": "true"
            },
            " It is HIGHLY recommended you surround the block with reflective alloy blocks to avoid potential disasters from occuring."
          ]
        },
        {
          "info": "Sensor",
          "text": [
            "This little dongle of a block will produce a flashing redstone signal against the block it's placed against.",
            "",
            "You can get a full continuous signal with 1 repeater from it but it's a good compact clock block otherwise when a beam intersects with it.",
            "",
            "",
            "Moreover, beams will phase directly through it for convenience."
          ]
        },
        {
          "info": "Optic Fiber",
          "text": [
            "Optic fiber cables are very important cabling here. Any beam pointed at one end of an optic fiber cable will output the beam",
            " at the other end of the cable whilst also adjusting it to the cardinal direction it's facing with absolutely no loss.",
            "",
            "One of the 2 cable facings will always face the direction you place it against for convenience. No more than 2 connections can be made per",
            " fiber optic cable, so it cannot split beams.",
            "",
            "These cables are also useful when working with reflection chambers. If you place a cable against the face of a reflection chamber",
            " - provided that the angle of the output beam from the reflection chamber is from the face the cable is against - it will output the beam",
            " straight to the cable, directly adjusting it to a cardinal direction."
          ]
        },
        {
          "info": "Spectrometer",
          "text": [
            "The spectrometer is a block that can show you the strength of each individual array of color from a beam intersecting with the block.",
            "",
            "It will show you red, green, blue, and white bars on its face indicating the rgb values of the beams hitting it as well as white acting as beam strength."
          ]
        },
        {
          "info": "Laser Pen",
          "text": [
            "KAT LAZORS."
          ]
        },
        {
          "info": "Photon Grenades",
          "text": [
            "When placed into an assembly table with any beam hitting it, it will infuse the grenade with that color.",
            "When thrown, the grenade will explode violently with the color (taking into account the original strength as well)"
          ]
        }
      ]
    },
    {
      "icon": "refraction:items/mirror",
      "info": "Third Page",
      "subpages": [
        {
          "info": "Hello3",
          "text": [
            "Hello there! I'm Eve, your personal assistant!",
            "I'm here to help you <study phys-ERR> use reflection and refraction to manipulate light beams!",
            "Let's get started, shall we?"
          ]
        },
        {
          "info": "muffinfssss",
          "text": [
            "Let's see here... Ah, yes. Ok so you'll first want to make an [[assembly_table]]. This simple block will help you craft everything you need. I will guide you through the steps of its usage when we get to that.",
            "For now, craft one. It requires 7 iron ingots and 1 [[lens]] block.",
            "",
            "Next, you'll want to craft a [[magnifier]] block. When provided with a 3x3 of lense blocks above it - provided that they have a line of sight to the sky - it will converge the sunlight into a focused beam of light directly below it.",
            "",
            "I should note that you should place the magnifier (with the lense blocks above it) anywhere above the assembly table. This will be a one time setup to get you the basic items and can be altered after we're done with the second step."
          ]
        }
      ]
    },
    {
      "icon": "refraction:items/laser_pointer",
      "info": "Fourth Page",
      "subpages": [
        {
          "info": "Hello4",
          "text": [
            "Hello there! I'm Eve, your personal assistant!",
            "I'm here to help you <study phys-ERR> use reflection and refraction to manipulate light beams!",
            "Let's get started, shall we?"
          ]
        },
        {
          "info": "<3333",
          "text": [
            "Let's see here... Ah, yes. Ok so you'll first want to make an [[assembly_table]]. This simple block will help you craft everything you need. I will guide you through the steps of its usage when we get to that.",
            "For now, craft one. It requires 7 iron ingots and 1 [[lens]] block.",
            "",
            "Next, you'll want to craft a [[magnifier]] block. When provided with a 3x3 of lense blocks above it - provided that they have a line of sight to the sky - it will converge the sunlight into a focused beam of light directly below it.",
            "",
            "I should note that you should place the magnifier (with the lense blocks above it) anywhere above the assembly table. This will be a one time setup to get you the basic items and can be altered after we're done with the second step."
          ]
        }
      ]
    }
  ]
}
